0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
// calculated from https://www.cfd-online.com/Tools/turbulence.php
internalField   uniform .007; // 

boundaryField
{
    wall1
    {
        type            fixedValue;
        value           uniform .007;
    }

    "(inlet1|outlet1|top)"
    {
        type            zeroGradient;
    }

    "(topEmptyFaces|bottomEmptyFaces)"
    {
        type            empty;
    }
}


// ************************************************************************* //
